Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
  if (!g_irEnabled && g_ambientLux <= g_irOnBelowLux) {
    applyIrState(true);
  } else if (g_irEnabled && g_ambientLux >= g_irOffAboveLux) {
    applyIrState(false);
  }
}

bool readAmbientLuxNow() {
  if (!g_lightReady) return false;
  const uint32_t raw = g_lightSensor.getData();
  const double lux = g_lightSensor.getLux(raw);
  if (!isfinite(lux) || lux < 0.0) return false;
  g_ambientLux = static_cast<float>(lux);
  evaluateIrAutomation();
  return true;
}

void handleLightSensor() {
  if (!g_lightReady) return;
  const uint32_t now = millis();
  if (now - g_lastLightReadMs < dfrcfg::kLightReadIntervalMs) return;
  g_lastLightReadMs = now;
  readAmbientLuxNow();
}

void rebuildStreamer() {
  g_streamer.reset();
  if (!g_cameraReady || !g_streamEnabled || WiFi.status() != WL_CONNECTED) return;

  camera_fb_t *probe = esp_camera_fb_get();
  if (probe == nullptr) {
    setError("camera probe frame failed");
    return;
  }
  const uint16_t width = probe->width;
  const uint16_t height = probe->height;
  esp_camera_fb_return(probe);

  g_streamer.reset(new Esp32RtspStreamer(width, height));
  // Match the proven Micro-RTSP transport used before the reconnect changes.
  g_streamer->setNonBlockingTcpWrites(false);
  g_streamer->setServiceCallback(serviceMqttDuringRtspWrite);
  const String hostPort = WiFi.localIP().toString() + ":" + String(dfrcfg::kRtspPort);
  g_streamer->setURI(hostPort, dfrcfg::kRtspPresentation, dfrcfg::kRtspStream);
  statusf("rtsp ready url=%s", rtspUrl().c_str());
}

void ensureRtspServer() {
  if (g_rtspServerStarted) return;
  g_rtspServer.begin();
  g_rtspServerStarted = true;
  statusf("rtsp server listening port=%u", dfrcfg::kRtspPort);
}

void publishSimple(const char *suffix, const String &value, bool retain = true) {
  if (g_mqttClient.connected()) {
    if (!g_mqttClient.publish(mqttTopic(suffix).c_str(), value.c_str(), retain)) {
      ++g_mqttPublishFailures;
    }
  }
}

void publishExternalSensors() {
  static bool bmePublishScheduleStarted = false;
  static uint32_t lastBmePublishMs = 0;
  const uint32_t now = millis();
  if (!bmePublishScheduleStarted) {
    bmePublishScheduleStarted = true;
    lastBmePublishMs = now;
  }
  if (now - lastBmePublishMs >= dfrcfg::kBme280PublishIntervalMs) {
    lastBmePublishMs = now;
    const dfrbme::Reading bme = dfrbme::reading();
    publishSimple("status/bme280", dfrbme::status());
    publishSimple("sensor/bme280/address", bme.address == 0 ? "-" : "0x" + String(bme.address, HEX));
    publishSimple("sensor/bme280/temperature_c", bme.valid ? String(bme.temperatureC, 2) : "-");
    publishSimple("sensor/bme280/humidity_percent", bme.valid ? String(bme.humidityPercent, 2) : "-");
    publishSimple("sensor/bme280/pressure_hpa", bme.valid ? String(bme.pressureHpa, 2) : "-");
    publishSimple("sensor/bme280/latest_temperature_c", bme.valid ? String(bme.latestTemperatureC, 2) : "-");
    publishSimple("sensor/bme280/latest_humidity_percent", bme.valid ? String(bme.latestHumidityPercent, 2) : "-");
    publishSimple("sensor/bme280/latest_pressure_hpa", bme.valid ? String(bme.latestPressureHpa, 2) : "-");
    publishSimple("sensor/bme280/average_samples", String(bme.averageSamples));
    publishSimple("sensor/bme280/read_failures", String(bme.readFailures));
    publishSimple(
        "sensor/bme280/age_seconds",
        bme.valid ? String((now - bme.lastUpdateMs) / 1000UL) : "-");

    String bmeJson = "{\"status\":\"" + String(dfrbme::status()) + "\"";
    if (bme.valid) {
      bmeJson += ",\"temperature_c\":" + String(bme.temperatureC, 2);
      bmeJson += ",\"humidity_percent\":" + String(bme.humidityPercent, 2);
      bmeJson += ",\"pressure_hpa\":" + String(bme.pressureHpa, 2);
      bmeJson += ",\"latest_temperature_c\":" + String(bme.latestTemperatureC, 2);
      bmeJson += ",\"latest_humidity_percent\":" + String(bme.latestHumidityPercent, 2);
      bmeJson += ",\"latest_pressure_hpa\":" + String(bme.latestPressureHpa, 2);
      bmeJson += ",\"average_samples\":" + String(bme.averageSamples);
    }
    bmeJson += "}";
    publishSimple("sensor/bme280/json", bmeJson);
  }

  const dfrvictron::Reading victron = dfrvictron::reading();
  publishSimple("status/victron_ble", dfrvictron::status());
  publishSimple("victron/mppt/configured", victron.configured ? "true" : "false");
  publishSimple("victron/mppt/charger_state", victron.valid ? dfrvictron::chargeStateName(victron.chargeState) : "-");
  publishSimple("victron/mppt/charger_state_id", victron.valid ? String(victron.chargeState) : "-");
  publishSimple("victron/mppt/error_code", victron.valid ? String(victron.errorCode) : "-");
  publishSimple("victron/mppt/battery_voltage_v", victron.valid ? String(victron.batteryVoltage, 2) : "-");
  publishSimple("victron/mppt/battery_current_a", victron.valid ? String(victron.batteryCurrent, 2) : "-");
  publishSimple("victron/mppt/panel_power_w", victron.valid ? String(victron.panelPower, 0) : "-");
  publishSimple("victron/mppt/yield_today_wh", victron.valid ? String(victron.yieldTodayWh) : "-");
  publishSimple("victron/mppt/load_current_a", victron.valid ? String(victron.loadCurrent, 2) : "-");
  publishSimple("victron/mppt/rssi", victron.valid ? String(victron.rssi) : "-");
  publishSimple(
      "victron/mppt/age_seconds",
      victron.valid ? String((millis() - victron.lastUpdateMs) / 1000UL) : "-");

  String victronJson = "{\"status\":\"" + String(dfrvictron::status()) + "\"";
  if (victron.valid) {
    victronJson += ",\"charger_state\":\"" + String(dfrvictron::chargeStateName(victron.chargeState)) + "\"";
    victronJson += ",\"error_code\":" + String(victron.errorCode);
    victronJson += ",\"battery_voltage_v\":" + String(victron.batteryVoltage, 2);
    victronJson += ",\"battery_current_a\":" + String(victron.batteryCurrent, 2);
    victronJson += ",\"panel_power_w\":" + String(victron.panelPower, 0);
    victronJson += ",\"yield_today_wh\":" + String(victron.yieldTodayWh);
    victronJson += ",\"load_current_a\":" + String(victron.loadCurrent, 2);
    victronJson += ",\"rssi\":" + String(victron.rssi);
  }
  victronJson += "}";
  publishSimple("victron/mppt/json", victronJson);
}

String buildConfigJson() {
  String json = "{";
  json.reserve(768);
  json += "\"framesize\":" + String(frameSizeToIndex(g_frameSize));
  json += ",\"framesize_name\":\"" + String(frameSizeName()) + "\"";
  json += ",\"jpeg_quality\":" + String(g_jpegQuality);
  json += ",\"stream_fps\":" + String(g_streamFps);
  json += ",\"brightness\":" + String(g_brightness);
  json += ",\"contrast\":" + String(g_contrast);
  json += ",\"saturation\":" + String(g_saturation);
  json += ",\"sharpness\":" + String(g_sharpness);
  json += ",\"gainceiling\":" + String(g_gainCeiling);
  json += ",\"colorbar\":" + String(g_colorbar);
  json += ",\"awb\":" + String(g_awb);
  json += ",\"agc\":" + String(g_agc);
  json += ",\"aec\":" + String(g_aec);
  json += ",\"awb_gain\":" + String(g_awbGain);
  json += ",\"agc_gain\":" + String(g_agcGain);
  json += ",\"aec_value\":" + String(g_aecValue);
  json += ",\"aec2\":" + String(g_aec2);
  json += ",\"dcw\":" + String(g_dcw);
  json += ",\"bpc\":" + String(g_bpc);
  json += ",\"wpc\":" + String(g_wpc);
  json += ",\"raw_gma\":" + String(g_rawGma);
  json += ",\"lenc\":" + String(g_lenc);
  json += ",\"special_effect\":" + String(g_specialEffect);
  json += ",\"wb_mode\":" + String(g_wbMode);
  json += ",\"ae_level\":" + String(g_aeLevel);
  json += ",\"hmirror\":" + String(g_hmirror);
  json += ",\"vflip\":" + String(g_vflip);
  json += ",\"led\":" + String(g_ledEnabled);
  json += ",\"stream_enabled\":";
  json += g_streamEnabled ? "true" : "false";
  json += ",\"ir_mode\":" + String(g_irMode);
  json += ",\"ir_mode_name\":\"" + String(irModeName()) + "\"";
  json += ",\"ir_enabled\":";
  json += g_irEnabled ? "true" : "false";
  json += ",\"ir_on_lux\":" + String(g_irOnBelowLux, 1);
  json += ",\"ir_off_lux\":" + String(g_irOffAboveLux, 1);
  json += ",\"server_capture_enabled\":";
  json += dfrcapture::enabled() ? "true" : "false";
  json += ",\"server_capture_interval_seconds\":" + String(dfrcapture::intervalSeconds());
  json += ",\"psram\":";
  json += g_psramReady ? "true" : "false";
  json += "}";
  return json;
}

