Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
void publishStatus(bool forceConfig) {
  static String previousConfig;
  if (!g_mqttClient.connected()) return;

  publishSimple("status/online", "true");
  publishSimple("status/state", streamState());
  publishSimple("status/error", g_lastError);
  publishSimple("status/ip", WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : "-");
  publishSimple("status/rtsp_url", rtspUrl());
  publishSimple("status/mdns", String(dfrcfg::kMdnsHostname) + ".local");
  publishSimple("status/last_status", g_lastStatus);
  publishSimple("status/clients", String(directStreamingSessionCount()));
  publishSimple("status/direct_sessions", String(directSessionCount()));
  publishSimple("status/direct_streaming_clients", String(directStreamingSessionCount()));
  publishSimple("status/frame_fps", String(g_lastMeasuredFps, 1));
  publishSimple("status/configured_fps", String(g_streamFps));
  publishSimple("status/mqtt_connected", "true");
  publishSimple("status/wifi_rssi", String(WiFi.RSSI()));
  publishSimple("status/uptime_seconds", String(millis() / 1000UL));
  publishSimple("status/free_heap_bytes", String(ESP.getFreeHeap()));
  publishSimple("status/firmware_version", camcommon::kFirmwareVersion);
  publishSimple("status/wifi_reconnect_count", String(g_wifiReconnectCount));
  publishSimple("status/mqtt_reconnect_count", String(g_mqttReconnectCount));
  publishSimple("status/camera_recovery_count", String(g_cameraRecoveryCount));
  publishSimple("status/mqtt_publish_failures", String(g_mqttPublishFailures));
  publishSimple("status/ambient_lux", isfinite(g_ambientLux) ? String(g_ambientLux, 2) : "-");
  publishSimple("status/ir_mode", irModeName());
  publishSimple("status/ir_enabled", g_irEnabled ? "true" : "false");
  publishSimple("status/light_sensor", g_lightReady ? "ready" : "unavailable");
  publishExternalSensors();
  publishSimple("status/capture_request/state", dfrcapture::state());
  publishSimple("status/capture_request/enabled", dfrcapture::enabled() ? "true" : "false");
  publishSimple("status/capture_request/interval_seconds", String(dfrcapture::intervalSeconds()));
  publishSimple("status/command/id", g_lastCommandId);
  publishSimple("status/command/name", g_lastCommandName);
  publishSimple("status/command/result", g_lastCommandResult);
  publishSimple("status/command/message", g_lastCommandMessage);
  publishSimple("status/command/at_ms", String(g_lastCommandAtMs));

  const String config = buildConfigJson();
  if (forceConfig || config != previousConfig) {
    publishSimple("status/config", config);
    previousConfig = config;
  }
}

void saveControllerSettings() {
  g_preferences.putInt("framesize", frameSizeToIndex(g_frameSize));
  g_preferences.putInt("quality", g_jpegQuality);
  g_preferences.putInt("fps", g_streamFps);
  g_preferences.putInt("bright", g_brightness);
  g_preferences.putInt("contrast", g_contrast);
  g_preferences.putInt("saturate", g_saturation);
  g_preferences.putInt("sharp", g_sharpness);
  g_preferences.putInt("gainceil", g_gainCeiling);
  g_preferences.putInt("colorbar", g_colorbar);
  g_preferences.putInt("awb", g_awb);
  g_preferences.putInt("agc", g_agc);
  g_preferences.putInt("aec", g_aec);
  g_preferences.putInt("awbgain", g_awbGain);
  g_preferences.putInt("agcgain", g_agcGain);
  g_preferences.putInt("aecvalue", g_aecValue);
  g_preferences.putInt("aec2", g_aec2);
  g_preferences.putInt("dcw", g_dcw);
  g_preferences.putInt("bpc", g_bpc);
  g_preferences.putInt("wpc", g_wpc);
  g_preferences.putInt("rawgma", g_rawGma);
  g_preferences.putInt("lenc", g_lenc);
  g_preferences.putInt("effect", g_specialEffect);
  g_preferences.putInt("wbmode", g_wbMode);
  g_preferences.putInt("aelevel", g_aeLevel);
  g_preferences.putInt("hmirror", g_hmirror);
  g_preferences.putInt("vflip", g_vflip);
  g_preferences.putBool("led", g_ledEnabled != 0);
  g_preferences.putBool("stream", g_streamEnabled);
  g_preferences.putInt("irmode", g_irMode);
  g_preferences.putFloat("ironlux", g_irOnBelowLux);
  g_preferences.putFloat("irofflux", g_irOffAboveLux);
}

void loadControllerSettings() {
  const uint8_t configVersion = g_preferences.getUChar("cfgver", 0);
  const bool alignDfrDefaults = configVersion < 2;
  g_frameSize = frameSizeFromIndex(clampValue(g_preferences.getInt("framesize", 6), 0, 7));
  g_jpegQuality = clampValue(g_preferences.getInt("quality", 10), 4, 63);
  g_streamFps = clampValue(g_preferences.getInt("fps", dfrcfg::kDefaultRtspFps), 1, 20);
  g_brightness = clampValue(g_preferences.getInt("bright", 1), -2, 2);
  g_contrast = clampValue(g_preferences.getInt("contrast", 0), -2, 2);
  g_saturation = clampValue(g_preferences.getInt("saturate", -2), -2, 2);
  g_sharpness = clampValue(g_preferences.getInt("sharp", 0), -2, 2);
  g_gainCeiling = clampValue(g_preferences.getInt("gainceil", 0), 0, 6);
  g_colorbar = g_preferences.getInt("colorbar", 0) ? 1 : 0;
  g_awb = g_preferences.getInt("awb", 1) ? 1 : 0;
  g_agc = g_preferences.getInt("agc", 1) ? 1 : 0;
  g_aec = g_preferences.getInt("aec", 1) ? 1 : 0;
  g_awbGain = g_preferences.getInt("awbgain", 1) ? 1 : 0;
  g_agcGain = clampValue(g_preferences.getInt("agcgain", 0), 0, 30);
  g_aecValue = clampValue(g_preferences.getInt("aecvalue", 300), 0, 1200);
  g_aec2 = g_preferences.getInt("aec2", 0) ? 1 : 0;
  g_dcw = g_preferences.getInt("dcw", 1) ? 1 : 0;
  g_bpc = g_preferences.getInt("bpc", 0) ? 1 : 0;
  g_wpc = g_preferences.getInt("wpc", 1) ? 1 : 0;
  g_rawGma = g_preferences.getInt("rawgma", 1) ? 1 : 0;
  g_lenc = g_preferences.getInt("lenc", 1) ? 1 : 0;
  g_specialEffect = clampValue(g_preferences.getInt("effect", 0), 0, 6);
  g_wbMode = clampValue(g_preferences.getInt("wbmode", 0), 0, 4);
  g_aeLevel = clampValue(g_preferences.getInt("aelevel", 0), -2, 2);
  g_hmirror = g_preferences.getInt("hmirror", 0) ? 1 : 0;
  g_vflip = g_preferences.getInt("vflip", 1) ? 1 : 0;
  g_ledEnabled = g_preferences.getBool("led", false) ? 1 : 0;
  g_streamEnabled = g_preferences.getBool("stream", true);
  g_irMode = clampValue(g_preferences.getInt("irmode", 2), 0, 2);
  g_irOnBelowLux = g_preferences.getFloat("ironlux", dfrcfg::kDefaultIrOnBelowLux);
  g_irOffAboveLux = g_preferences.getFloat("irofflux", dfrcfg::kDefaultIrOffAboveLux);
  if (g_irOffAboveLux <= g_irOnBelowLux) g_irOffAboveLux = g_irOnBelowLux + 2.0f;

  // Match DFRobot's CameraWebServer defaults once; later user changes remain persistent.
  if (alignDfrDefaults) {
    g_frameSize = FRAMESIZE_UXGA;
    g_jpegQuality = 10;
    g_brightness = 1;
    g_contrast = 0;
    g_saturation = -2;
    g_sharpness = 0;
    g_vflip = 1;
    saveControllerSettings();
  }
  if (configVersion < 3) {
    saveControllerSettings();
    g_preferences.putUChar("cfgver", 3);
  }
}

bool applySensorSettings(bool rebuildAfter) {
  sensor_t *sensor = esp_camera_sensor_get();
  if (sensor == nullptr) {
    setError("camera sensor unavailable");
    return false;
  }
  bool success = true;
  String failedSetting;
  const auto check = [&](int result, const char *name) {
    if (result == 0) return;
    success = false;
    if (failedSetting.length() == 0) failedSetting = name;
  };

  check(sensor->set_framesize(sensor, g_frameSize), "framesize");
  check(sensor->set_quality(sensor, g_jpegQuality), "jpeg_quality");
  check(sensor->set_brightness(sensor, g_brightness), "brightness");
  check(sensor->set_contrast(sensor, g_contrast), "contrast");
  check(sensor->set_saturation(sensor, g_saturation), "saturation");
  check(sensor->set_sharpness(sensor, g_sharpness), "sharpness");
  check(sensor->set_gainceiling(sensor, static_cast<gainceiling_t>(g_gainCeiling)), "gainceiling");
  check(sensor->set_colorbar(sensor, g_colorbar), "colorbar");
  check(sensor->set_whitebal(sensor, g_awb), "awb");
  check(sensor->set_gain_ctrl(sensor, g_agc), "agc");
  check(sensor->set_exposure_ctrl(sensor, g_aec), "aec");
  check(sensor->set_awb_gain(sensor, g_awbGain), "awb_gain");
  check(sensor->set_agc_gain(sensor, g_agcGain), "agc_gain");
  check(sensor->set_aec_value(sensor, g_aecValue), "aec_value");
  check(sensor->set_aec2(sensor, g_aec2), "aec2");
  check(sensor->set_dcw(sensor, g_dcw), "dcw");
  check(sensor->set_bpc(sensor, g_bpc), "bpc");
  check(sensor->set_wpc(sensor, g_wpc), "wpc");
  check(sensor->set_raw_gma(sensor, g_rawGma), "raw_gma");
  check(sensor->set_lenc(sensor, g_lenc), "lenc");
  check(sensor->set_special_effect(sensor, g_specialEffect), "special_effect");
  check(sensor->set_wb_mode(sensor, g_wbMode), "wb_mode");
  check(sensor->set_ae_level(sensor, g_aeLevel), "ae_level");
  check(sensor->set_hmirror(sensor, g_hmirror), "hmirror");
  check(sensor->set_vflip(sensor, g_vflip), "vflip");
  applyLedState(g_ledEnabled != 0);
  evaluateIrAutomation();
  if (rebuildAfter) rebuildStreamer();
  if (!success) {
    setError("camera setting apply failed: " + failedSetting);
    return false;
  }
  clearError();
  return true;
}

