Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
  if (topicText == mqttTopic("cmd/start")) {
    g_streamEnabled = true;
    saveControllerSettings();
    rebuildStreamer();
    clearError();
    setCommandResult("start", requestId, "ok", "stream enabled");
    recordStatus("mqtt start command");
  } else if (topicText == mqttTopic("cmd/stop")) {
    g_streamEnabled = false;
    saveControllerSettings();
    g_streamer.reset();
    setCommandResult("stop", requestId, "ok", "stream disabled");
    recordStatus("mqtt stop command");
  } else if (topicText == mqttTopic("cmd/restart")) {
    setCommandResult("restart", requestId, "ok", "device rebooting");
    publishSimple("status/state", "restarting");
    publishStatus(true);
    g_mqttClient.loop();
    delay(100);
    ESP.restart();
  } else if (topicText == mqttTopic("cmd/ping")) {
    publishSimple("status/pong", requestId.length() > 0 ? requestId : (payloadText.length() > 0 ? payloadText : "pong"));
    setCommandResult("ping", requestId, "ok", "pong");
  } else if (topicText == mqttTopic("cmd/set")) {
    applyControlPayload(payloadText);
  } else if (topicText == mqttTopic("cmd/timelapse/start")) {
    if (!dfrcapture::setEnabled(true)) {
      setError("unable to start server capture");
      setCommandResult("capture_start", requestId, "error", g_lastError);
    } else {
      setCommandResult("capture_start", requestId, "ok", "server capture requested");
    }
  } else if (topicText == mqttTopic("cmd/timelapse/stop")) {
    dfrcapture::setEnabled(false);
    setCommandResult("capture_stop", requestId, "ok", "server capture disabled");
  } else if (topicText == mqttTopic("cmd/timelapse/set")) {
    applyTimelapsePayload(payloadText);
  }
  publishStatus(true);
}

void mqttCallback(char *topic, byte *payload, unsigned int length) {
  const String topicText(topic);
  String payloadText;
  payloadText.reserve(length + 1);
  for (unsigned int index = 0; index < length; ++index) payloadText += static_cast<char>(payload[index]);
  Serial.printf("[MQTT] %s: %s\n", topicText.c_str(), payloadText.c_str());
  g_pendingMqttTopic = topicText;
  g_pendingMqttPayload = payloadText;
  g_pendingMqttMessage = true;
}

void handlePendingMqttMessage() {
  if (!g_pendingMqttMessage) return;
  const String topic = g_pendingMqttTopic;
  const String payload = g_pendingMqttPayload;
  g_pendingMqttMessage = false;
  g_pendingMqttTopic = "";
  g_pendingMqttPayload = "";
  processMqttMessage(topic, payload);
}

void ensureMqtt() {
  if (WiFi.status() != WL_CONNECTED) return;
  g_mqttClient.loop();
  if (g_mqttClient.connected()) return;

  const uint32_t now = millis();
  if (now - g_lastMqttAttemptMs < dfrcfg::kMqttRetryMs) return;
  g_lastMqttAttemptMs = now;

  g_mqttClient.setServer(dfrcfg::kMqttHost, dfrcfg::kMqttPort);
  g_mqttClient.setCallback(mqttCallback);
  g_mqttClient.setSocketTimeout(1);
  g_mqttClient.setKeepAlive(20);
  g_mqttClient.setBufferSize(2048);
  const String willTopic = mqttTopic("status/online");
  bool connected = false;
  if (strlen(dfrcfg::kMqttUsername) > 0) {
    connected = g_mqttClient.connect(
        dfrcfg::kMqttClientId,
        dfrcfg::kMqttUsername,
        dfrcfg::kMqttPassword,
        willTopic.c_str(),
        1,
        true,
        "false");
  } else {
    connected = g_mqttClient.connect(dfrcfg::kMqttClientId, willTopic.c_str(), 1, true, "false");
  }
  if (!connected) {
    g_mqttSocket.stop();
    statusf("mqtt connect failed rc=%d", g_mqttClient.state());
    return;
  }

  if (g_mqttEverConnected) ++g_mqttReconnectCount;
  g_mqttEverConnected = true;

  g_mqttClient.subscribe(mqttTopic("cmd/start").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/stop").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/restart").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/ping").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/set").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/timelapse/start").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/timelapse/stop").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/timelapse/set").c_str(), 1);
  statusf("mqtt connected topic=%s", dfrcfg::kMqttBaseTopic);
  publishStatus(true);
}

void handleRtspLoop() {
  if (WiFi.status() != WL_CONNECTED || !g_cameraReady) return;
  if (!g_streamEnabled) {
    WiFiClient waitingClient = g_rtspServer.accept();
    if (waitingClient) waitingClient.stop();
    return;
  }
  if (g_streamer == nullptr) rebuildStreamer();
  if (g_streamer == nullptr) return;

  g_streamer->handleRequests(0);
  const uint32_t now = millis();
  const uint32_t frameIntervalMs = 1000UL / static_cast<uint32_t>(max(1, g_streamFps));
  if (g_streamer->anySessions() &&
      (now - g_lastFrameAtMs >= frameIntervalMs || now < g_lastFrameAtMs)) {
    g_streamer->streamImage(now);
    g_lastFrameAtMs = now;
    if (g_streamer->lastFrameSucceeded()) {
      ++g_framesSent;
    } else if (g_streamer->consecutiveCaptureFailures() >= 5) {
      requestCameraRecovery("repeated frame capture failures");
    }
  }

  WiFiClient client = g_rtspServer.accept();
  if (client) {
    client.setNoDelay(true);
    const String remote = client.remoteIP().toString();
    g_streamer->addSession(new WiFiClient(client));
    statusf("rtsp client=%s", remote.c_str());
  }
}

void updateRuntimeStats() {
  const uint32_t now = millis();
  if (now - g_lastStatsMs < dfrcfg::kStatusIntervalMs) return;
  const float seconds = g_lastStatsMs == 0 ? 5.0f : (now - g_lastStatsMs) / 1000.0f;
  g_lastMeasuredFps = g_framesSent / seconds;
  g_framesSent = 0;
  g_lastStatsMs = now;
  statusf(
      "runtime wifi=%s mqtt=%s rtsp=%s sessions=%d fps=%.1f lux=%.2f ir=%s timelapse=%s",
      WiFi.status() == WL_CONNECTED ? "up" : "down",
      g_mqttClient.connected() ? "up" : "down",
      g_streamEnabled ? "on" : "off",
      directStreamingSessionCount(),
      g_lastMeasuredFps,
      g_ambientLux,
      g_irEnabled ? "on" : "off",
      dfrcapture::state().c_str());
  publishStatus();
}

}  // namespace

namespace dfr1154 {

void setupController() {
  Serial.begin(115200);
  delay(500);
  Serial.println("\n[BOOT] DFR1154 camera controller starting");

  pinMode(DFR_LED_PIN, OUTPUT);
  pinMode(DFR_IR_PIN, OUTPUT);
  digitalWrite(DFR_LED_PIN, LOW);
  digitalWrite(DFR_IR_PIN, LOW);

  Wire.begin(DFR_CAM_SIOD, DFR_CAM_SIOC, 100000);

  g_preferences.begin("dfrcam", false);
  loadControllerSettings();
  initCamera();
  configureLightSensor();
  dfrbme::begin();
  dfrcapture::begin();

  statusf(
      "flash=%luMB psram=%luMB heap=%luKB",
      ESP.getFlashChipSize() / (1024UL * 1024UL),
      ESP.getPsramSize() / (1024UL * 1024UL),
      ESP.getFreeHeap() / 1024UL);

  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.onEvent(onWifiEvent);
  enableLoopWDT();
  ensureWifi();
  dfrvictron::begin();
}

void loopController() {
  if (g_otaReady) ArduinoOTA.handle();
  dfrbme::loop();
  handleWifiEvents();
  ensureWifi();
  handleNetworkServices();
  if (g_otaActive) {
    delay(1);
    return;
  }
  dfrvictron::loop();
  ensureMqtt();
  handlePendingMqttMessage();
  if (g_otaReady) ArduinoOTA.handle();
  handleCameraRecovery();
  handleLightSensor();
  handleRtspLoop();
  updateRuntimeStats();
  delay(1);
}

}  // namespace dfr1154
